Revit 2024 API
RepeaterCoordinates.GetCoordinate Method
 Returns the coordinate in the given dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int GetCoordinate(
	int dimension
)
Visual Basic
Public Function GetCoordinate ( _
	dimension As Integer _
) As Integer
Visual C++
public:
int GetCoordinate(
	int dimension
)
Parameters
dimension
Type: System.Int32
 The dimension.
Return Value
 The coordinate.
Remarks
 The dimension begins at 0 and must be in the range [0, number of dimensions in the bounds - 1]. This method does not apply to zero dimensional coordinates.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The dimension is invalid for these coordinates.
Autodesk.Revit.Exceptions.InvalidOperationException |  The coordinates must have at least one dimension.
See Also
RepeaterCoordinates Class
Autodesk.Revit.DB Namespace